---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.HostForCutHasNoGeometryWarn
source: html/99f5a7b8-3237-18c8-65ef-e66e025666b4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.HostForCutHasNoGeometryWarn Property

Host can't be cut because it has no geometry.

## Syntax (C#)
```csharp
public static FailureDefinitionId HostForCutHasNoGeometryWarn { get; }
```